---
kind: property
id: P:Autodesk.Revit.DB.ExportPatternTableIterator.CurrentObject
source: html/08958722-956f-03a9-5750-782c22ffa296.htm
---
# Autodesk.Revit.DB.ExportPatternTableIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```